# Part 3: Construct and export a MySQL database using your data.

In [1]:
# Standard Imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
# Additional Imports
import os, json, math, time
from yelpapi import YelpAPI
from tqdm.notebook import tqdm_notebook

In [2]:
basics_df = pd.read_csv('Data/title_basics.csv.gz')
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [3]:
title_ratings = pd.read_csv('Data/title_ratings.csv.gz')
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1914
1  tt0000002            5.8       259
2  tt0000005            6.2      2537
3  tt0000006            5.1       175
4  tt0000007            5.4       793

In [4]:
tmbd_df = pd.read_csv('Data/tmdb_results_combined.csv.gz')
tmbd_data = tmbd_df[['imdb_id','budget', 'revenue','certifcation']]
tmbd_data.head()

     imdb_id       budget       revenue certifcation
0  tt0848228  220000000.0  1.518816e+09        PG-13
1  tt0848228  220000000.0  1.518816e+09        PG-13
2  tt0848228  220000000.0  1.518816e+09        PG-13
3  tt0848228  220000000.0  1.518816e+09        PG-13
4  tt0848228  220000000.0  1.518816e+09        PG-13

In [5]:
# Check genres in Basics.
basics_df['genres']

0           Comedy,Fantasy,Romance
1                            Drama
2                            Drama
3             Comedy,Horror,Sci-Fi
4                            Drama
                   ...
79704                        Drama
79705         Comedy,Drama,Fantasy
79706                        Drama
79707    Action,Adventure,Thriller
79708                Drama,History
Name: genres, Length: 79709, dtype: object

In [6]:
# Convert these strings into lists of strings.
basics_df['genres_split'] = basics_df['genres'].str.split(',')
basics_df

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama,[Drama]
...,...,...,...,...,...,...,...,...,...,...
79704,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019.0,NaN,74,Drama,[Drama]
79705,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019.0,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
79706,tt9916170,movie,The Rehearsal,O Ensaio,0,2019.0,NaN,51,Drama,[Drama]
79707,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
79708,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History","[Drama, History]"

In [7]:
# Let's use explode to separate the list of genres into new rows
exploded_genres = basics_df.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
79707,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Action
79707,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Adventure
79707,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
79708,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",Drama
79708,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",History

In [8]:
# Let's use .unique() to get the unique genres.
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [9]:
# Make integers for each genre.
genre_id = range(len(unique_genres))
genre_id

range(0, 26)

In [10]:
# Zip together the genre names & ids.
genre_map = dict(zip(unique_genres, genre_id))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [11]:
# Using pd.DataFrame and a dictionary
genres = pd.DataFrame({'genre_name': genre_map.keys(),
                         'genre_id':genre_map.values()})
genres.head(5)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [12]:
# Lookup the new genres id.
exploded_genres['genres_split'].map(genre_map)

0         5
0         9
0        18
1         7
2         7
         ..
79707     0
79707     2
79707    23
79708     7
79708    11
Name: genres_split, Length: 149292, dtype: int64

In [13]:
# Create genre_id column.
exploded_genres['genre_id'] = exploded_genres['genres_split'].map(genre_map)
exploded_genres.head(5)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split,genre_id
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy,5
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy,9
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance,18
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama,Drama,7
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,Drama,7

In [14]:
# Clean and copy dataframe.
exploded_genres = exploded_genres.drop(columns=['titleType', 'titleType',
                                               'primaryTitle', 'originalTitle',
                                               'isAdult', 'startYear', 'endYear',
                                               'runtimeMinutes', 'genres', 'genres_split'])
title_genres = exploded_genres

In [15]:
title_genres

          tconst  genre_id
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0062336         7
2      tt0069049         7
...          ...       ...
79707  tt9916190         0
79707  tt9916190         2
79707  tt9916190        23
79708  tt9916362         7
79708  tt9916362        11

[149292 rows x 2 columns]

In [16]:
basics_df = basics_df.drop(columns=['originalTitle', 'isAdult', 'endYear',
                                   'titleType', 'genres', 'genres_split'])
basics_df

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126
...,...,...,...,...
79704,tt9914942,Life Without Sara Amat,2019.0,74
79705,tt9915872,The Last White Witch,2019.0,97
79706,tt9916170,The Rehearsal,2019.0,51
79707,tt9916190,Safeguard,2020.0,95
79708,tt9916362,Coven,2020.0,92

In [17]:
basics_df['startYear'] = basics_df['startYear'].apply(np.int64)
title_basics = basics_df.copy()
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79709 entries, 0 to 79708
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          79709 non-null  object
 1   primaryTitle    79709 non-null  object
 2   startYear       79709 non-null  int64
 3   runtimeMinutes  79709 non-null  int64
dtypes: int64(2), object(2)
memory usage: 2.4+ MB

In [18]:
# Let's check how clean is the data so far.
title_basics.duplicated().sum()

0

In [19]:
# Checking missing data.
title_basics.isna().sum()

tconst            0
primaryTitle      0
startYear         0
runtimeMinutes    0
dtype: int64

In [20]:
tmbd_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11206 entries, 0 to 11205
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   imdb_id       11206 non-null  object
 1   budget        11206 non-null  float64
 2   revenue       11206 non-null  float64
 3   certifcation  10374 non-null  object
dtypes: float64(2), object(2)
memory usage: 350.3+ KB

In [21]:
tmbd_data.duplicated().sum()

9997

In [22]:
tmbd_data.drop_duplicates(inplace=True)

/var/folders/14/flzfm6gs26s8jr6l_k7z6lh00000gn/T/ipykernel_25120/2290814205.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  tmbd_data.drop_duplicates(inplace=True)

In [23]:
tmbd_data.isna().sum()

imdb_id           0
budget            0
revenue           0
certifcation    832
dtype: int64

In [24]:
from sqlalchemy.types import *
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

# Load mysql credentials
username = 'root'
password = 'Plantdadbo#21'

movies = f"mysql+pymysql://{username}:{password}@localhost/movies"
engine = create_engine(movies)
engine

Engine(mysql+pymysql://root:***@localhost/movies)

In [25]:
# Create the database.
if database_exists(movies) == False: create_database(movies)
else: print('The database already exists.')

The database already exists.

In [26]:
# Check the dtypes of our dataframes.
print('\033[1m Title Basic Data:\033[0;0m\n', title_basics.dtypes)
print('\n\033[1m Title Ratings Data:\033[0;0m\n', title_ratings.dtypes)
print('\n\033[1m Title Genres Data:\033[0;0m\n', title_genres.dtypes)
print('\n\033[1m Genres Data:\033[0;0m\n', genres.dtypes)
print('\n\033[1m TMBD Data:\033[0;0m\n', tmbd_data.dtypes)

 Title Basic Data:
 tconst            object
primaryTitle      object
startYear          int64
runtimeMinutes     int64
dtype: object

 Title Ratings Data:
 tconst            object
averageRating    float64
numVotes           int64
dtype: object

 Title Genres Data:
 tconst      object
genre_id     int64
dtype: object

 Genres Data:
 genre_name    object
genre_id       int64
dtype: object

 TMBD Data:
 imdb_id          object
budget          float64
revenue         float64
certifcation     object
dtype: object

In [27]:
# Export data as csv.
title_basics.to_csv('Data/title_basics.csv.gz', compression ='gzip', index = False)

In [28]:
# Calculate max string lengths for object columns.
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()

In [29]:
# Create schema dictionary.
basics_schema = {
    'tconst': String(key_len+1),
    'primaryTitle': Text(title_len+1),
    'startYear': Integer(),
    'runTimeMinutes': Integer()}

In [30]:
# Convert to a sql table.
title_basics.to_sql('title_basics', engine, dtype = basics_schema,
                    if_exists = 'replace', index = False)

79709

In [31]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [32]:
# Export data as csv.
title_ratings.to_csv('Data/title_ratings.csv.gz', compression ='gzip', index = False)

In [33]:
# Create schema dictionary
ratings_schema ={
    'tconst': String(key_len+1),
    'averageRating': Float(),
    'genre_id': Integer()}

In [34]:
# Convert to a sql table.
title_ratings.to_sql('title_ratings', engine, dtype = ratings_schema,
                    if_exists = 'replace', index = False)

477742

In [35]:
# Assign primary key.
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [36]:
# Export data as csv.
title_genres.to_csv('Data/title_genres.csv.gz', compression ='gzip', index = False)

In [37]:
# Create schema dictionary
title_genres_schema ={
    'tconst': String(key_len+1),
    'genre_id': Integer()}

In [38]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres', engine, dtype = title_genres_schema,
                    if_exists = 'replace', index = False)

149292

In [39]:
# Export data as csv.
genres.to_csv('Data/genres.csv.gz', compression ='gzip', index = False)

In [40]:
# Create schema dictionary
genres_schema ={
    'genre_name': String(key_len+1),
    'genre_id': Integer()}

In [41]:
# Save to sql with dtype and index=False
genres.to_sql('genres', engine, dtype = genres_schema,
                    if_exists = 'replace', index = False)

26

In [42]:
# Assign primary key.
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [43]:
# Export data as csv.
tmbd_data.to_csv('Data/tmbd_data.csv.gz', compression ='gzip', index = False)

In [44]:
# Calculate max string lengths for object columns.
certification_len = tmbd_data['certifcation'].fillna('').map(len).max()

In [45]:
# Create schema dictionary
tmdb_schema ={
    'imdb_id': String(key_len+1),
    "budget": Float(),
    'revenue': Float(),
    'certifcation': String(certification_len+1)}

In [46]:
# Convert to a sql table.
tmbd_data.to_sql('tmbd_data', engine, dtype = tmdb_schema,
                    if_exists = 'replace', index = False)

1209

In [47]:
# Assign primary key.
engine.execute('ALTER TABLE tmbd_data ADD PRIMARY KEY (`imdb_id`);')

In [48]:
# Check the communication.
q = '''
SHOW TABLES;
'''
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmbd_data

In [49]:
q = '''
SELECT * 
FROM title_basics LIMIT 5
'''
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

In [50]:
q = '''
SELECT * 
FROM title_ratings LIMIT 5
'''
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1914
1  tt0000002            5.8       259
2  tt0000005            6.2      2537
3  tt0000006            5.1       175
4  tt0000007            5.4       793

In [51]:
q = '''
SELECT * 
FROM title_genres LIMIT 5
'''
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [52]:
q = '''
SELECT * 
FROM genres LIMIT 5
'''
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [53]:
q = '''
SELECT * 
FROM tmbd_data LIMIT 5
'''
pd.read_sql(q, engine)

     imdb_id      budget     revenue certifcation
0  tt0113026  10000000.0         0.0         None
1  tt0113092         0.0         0.0         None
2  tt0116391         0.0         0.0         None
3  tt0118694    150000.0  12855000.0           PG
4  tt0118852         0.0         0.0            R